//{===========================================================================
//! @file       Most\Graph\FRS.cpp
//!
//! @brief      Программа построения графиков "Ботан++"
//!
//!             Программа призвана упростить изучение простейших графиков.
//!             Программа является примером работы библиотеки APLib
//!
//! @date       2015
//! @author     Переведенцев Артем, 7 класс
//          (C) Переведенцев Артем, 7 класс, 2015
//}===========================================================================

#include "Draw.h"

//============================================================================

void MainWhile (Draw draw, Write write);

//============================================================================

int main()
{
    txCreateWindow (x_size, y_size);

    Draw draw;

    Write write;

    Timeline timeline;

    txTextCursor (false);

    MainWhile (draw, write);

    return 0;
}

//============================================================================

void MainWhile (Draw draw, Write write)
{
    draw.DrawWindow (write);

    while (!Key (VK_ESCAPE))
    {
        draw.Control(write);

        draw.DrawPush ();
    }
}
